---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.WatchedLinkMoved
source: html/7001c92a-9ddf-9422-777a-b507763b2ce2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.WatchedLinkMoved Property

Monitored Link moved.

## Syntax (C#)
```csharp
public static FailureDefinitionId WatchedLinkMoved { get; }
```